**Задание 1**
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd
ratings = pd.read_csv('ratings.csv')

In [2]:
ratings[:5]

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [3]:
ratings.query(f'rating == {format(5.0)}')['movieId'].value_counts().head(10)

318     153
296     123
356     116
2571    109
260     104
593      92
527      92
858      88
2959     81
1196     80
Name: movieId, dtype: int64

**Задание 2**
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [6]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [8]:
filtered_power = power.query('country == ["Latvia", "Lithuania", "Estonia"] & category == [4, 12, 21] & year >= 2005 & year <= 2010 & quantity > 0')
filtered_power

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
11158   Lithuania  2006       1.0         4
11159   Lithuania  2005       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[347 rows x 4 columns]

In [9]:
filtered_power['quantity'].sum

<bound method Series.sum of 10617      1.0
10620      1.0
11156      1.0
11158      1.0
11159      1.0
          ...
253982    98.0
253983    54.0
253984    47.0
253985    31.0
253986     1.0
Name: quantity, Length: 347, dtype: float64>

**Задание 3**
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe. Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [13]:
page_url = 'https://infotables.ru/meditsina/1198-koronavirus-v-rossii'
course = pd.read_html(page_url, attrs = {'class': 'tables90'}, encoding='utf-8')
course[0].head(10)

,0,1,2,3,4,5
0,№,Города России с корона­вирусом и субъ­екты РФ,Забо­левшие,Умер­ли,Выздо­ровели,На 1000
1,NaN,РОССИЯ (Всего),1547774 +16550,26589,1158940,105
2,1,Москва,405352 +4312,6503,296474,319
3,2,Московская область,84743 +496,1563,63067,110
4,3,Санкт-Петербург,58236 +721,3674,36833,108
5,4,Нижегородская область,40005 +369,732,33611,125
6,5,Свердловская область,35069 +287,748,27074,81
7,6,Ростовская область,29369 +311,772,23449,70
8,7,Ханты-Мансийский АО,27481 +194,232,23599,164
9,8,Красноярский край,25293 +277,640,18259,88

**Задание 4**
Напишите функцию, которая классифицирует фильмы из материалов занятия по следующим правилам:
- оценка 2 и меньше - низкий рейтинг
- оценка 4 и меньше - средний рейтинг
- оценка 4.5 и 5 - высокий рейтинг

Результат классификации запишите в столбец class

In [88]:
def func(rating):
    if rating <= 2:
        return 'низкий рейтинг'
    if rating < 4.5:
        return 'средний рейтинг'
    if rating >= 4.5 and rating <= 5:
        return 'высокий рейтинг'
    return 'Ошибка'

def cl():
    movies = pd.read_csv('movies.csv')
    classified = ratings.merge(movies, on=["movieId"], how='right').pivot_table(index=['title','movieId'], values = 'rating', aggfunc='mean')
    classified['class'] = classified['rating'].apply(func)
    print(classifiedRating.head(-10))
cl()

                                                   rating            class
title                                   movieId
'71 (2014)                              117867   4.000000  средний рейтинг
'Hellboy': The Seeds of Creation (2004) 97757    4.000000  средний рейтинг
'Round Midnight (1986)                  26564    3.500000  средний рейтинг
'Salem's Lot (2004)                     27751    5.000000  высокий рейтинг
'Til There Was You (1997)               779      4.000000  средний рейтинг
...                                                   ...              ...
Zoolander 2 (2016)                      148888   2.500000  средний рейтинг
Zoom (2006)                             47384    2.500000  средний рейтинг
Zoom (2015)                             156553   2.500000  средний рейтинг
Zootopia (2016)                         152081   3.890625  средний рейтинг
Zulu (1964)                             5899     4.000000  средний рейтинг

[9714 rows x 2 columns]

**Задание 5**
Используем файл keywords.csv.

Необходимо написать гео-классификатор, который каждой строке сможет выставить географическую принадлежность определенному 
региону. Т. е. если поисковый запрос содержит название города региона, то в столбце ‘region’ пишется название этого региона. 
Если поисковый запрос не содержит названия города, то ставим ‘undefined’.

Правила распределения по регионам Центр, Северо-Запад и Дальний Восток:

geo_data = {
'Центр': ['москва', 'тула', 'ярославль'],
'Северо-Запад': ['петербург', 'псков', 'мурманск'],
'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']
}

Результат классификации запишите в отдельный столбец region.

In [20]:
keywords = pd.read_csv('keywords.csv')
geo_data = {'Центр': ['москва', 'тула', 'ярославль'], 
            'Северо-Запад': ['петербург', 'псков', 'мурманск'], 
            'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск'] }

In [21]:
keywords.head()

         keyword     shows
0             вк  64292779
1  одноклассники  63810309
2          порно  41747114
3           ютуб  39995567
4      вконтакте  21014195

In [24]:
def func(keyword):
    for region in geo_data:
        if keyword in region:
            return region
    return 'undefined'

In [25]:
keywords['region'] = keywords['keyword'].apply(func)

In [31]:
keywords.head(10)

                      keyword     shows     region
0                          вк  64292779  undefined
1               одноклассники  63810309  undefined
2                       порно  41747114  undefined
3                        ютуб  39995567  undefined
4                   вконтакте  21014195  undefined
5  одноклассники моя страница  19976138  undefined
6                        майл  15144673  undefined
7                       авито  14786593  undefined
8                  переводчик  14453469  undefined
9                      яндекс  13344734  undefined

**Задание 6**
Есть мнение, что “раньше снимали настоящее кино, не то что сейчас”. Ваша задача проверить это утверждение, используя файлы 
с рейтингами фильмов из прошлого домашнего занятия (файл ratings.csv из базы https://grouplens.org/datasets/movielens). Т. е. проверить верно ли, что с ростом года выпуска фильма его средний рейтинг становится ниже.

При этом мы не будем затрагивать субьективные факторы выставления этих рейтингов, а пройдемся по следующему алгоритму:

В переменную years запишите список из всех годов с 1950 по 2010.

Напишите функцию production_year, которая каждой строке из названия фильма выставляет год выпуска. Не все названия фильмов содержат год выпуска в одинаковом формате, поэтому используйте следующий алгоритм:

для каждой строки пройдите по всем годам списка years
если номер года присутствует в названии фильма, то функция возвращает этот год как год выпуска
если ни один из номеров года списка years не встретился в названии фильма, то возвращается 1900 год
Запишите год выпуска фильма по алгоритму пункта 2 в новый столбец ‘year’

Посчитайте средний рейтинг всех фильмов для каждого значения столбца ‘year’ и отсортируйте результат по убыванию рейтинга

In [51]:
movies = pd.read_csv('movies.csv')

In [48]:
ratings.head(10)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931
5       1       70     3.0  964982400
6       1      101     5.0  964980868
7       1      110     4.0  964982176
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [52]:
movies.head(10)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [53]:
table = movies.merge(ratings)

In [54]:
table.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483

In [55]:
years = [x for x in range(1950,2010)]

In [59]:
def production_year(title):
    for year in years:
        if str(year) in title:
            return year
    return 1900

In [60]:
table['year'] = table['title'].apply(production_year)

In [62]:
table.head()

,movieId,title,genres,userId,rating,timestamp,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703,1995
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962,1995
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946,1995
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970,1995
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483,1995

In [64]:
table2 = table.pivot_table(index = ['year'], values = 'rating', aggfunc='mean')
table2.head()

        rating
year
1900  3.542858
1950  3.813665
1951  3.804945
1952  3.953125
1953  3.647059

In [66]:
table2.sort_values(by = ['rating'], ascending = False).head(10)

        rating
year
1957  4.039535
1954  4.009191
1962  3.969466
1952  3.953125
1972  3.944293
1964  3.940160
1974  3.935622
1967  3.922572
1975  3.879121
1958  3.842424